DataProcessors/фин_УправлениеСтруктуройБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>фин_УправлениеСтруктуройБюджета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникПроектов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСортировкиСтатей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСортировкиСтатейПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКодыСтрокБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДетализацииБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_УровниДетализацииБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияКлассификатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсионироватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСумме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоКоличеству</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЦенообразования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_СпособыЦенообразованияПоФинансовымПоказателям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез4</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез7</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез8</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез9</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрез10</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключаяПодчиненныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемыйТипЦен</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникТиповЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанныхДляЦены</Name>
					<Comment>Источник данных для расчетов бюджетирования, ресурс которого будет использоваться для пересчета количественных оборотов по статье в суммовые</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ИсточникиДанныхДляРасчетовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИсточникаДанныхДляЦены</Name>
					<Comment>Показатель источника данных расчетов бюджетирования, который будет использоваться для пересчета количественного оборота по статье в суммовой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимыРасчетаИтоговойСтрокиБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_РежимыРасчетаИтоговойСтрокиБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяФункция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ИтоговыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНастройкаИтоговПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноФормированиеНаОснованииПлановЗакупок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноФормированиеНаОснованииПлановДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьКоличественныхПоказателей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаКоличество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФормулыРасчетаФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазрезыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измерение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_СправочникУправленческихПодразделений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/фин_УправлениеСтруктуройБюджета/Forms/ФормаНастройкиПодачиЗаявок/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметры,"Бюджет,Версия");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям.УправленческоеПодразделение
		|ИЗ
		|	РегистрСведений.фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям КАК фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям
		|ГДЕ
		|	фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям.Бюджет = &Бюджет
		|
		|УПОРЯДОЧИТЬ ПО
		|	фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям.УправленческоеПодразделение.Наименование";
	
	Запрос.УстановитьПараметр("Бюджет", Бюджет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Подразделения.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("УправленческоеПодразделение"));
	ЗаполнитьДанные();
	СписокРежимы.Добавить(Истина,"Разрешить");
	СписокРежимы.Добавить(Ложь,"Запретить");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанные()
	ТабличныйДокумент.Очистить();
	ДанныеРасшифровкиКомпоновкиДанных = Неопределено;	
	Отчет = Отчеты.фин_ПравилаПодачиЗаявокПоБюджетам.Создать();
	Отчет.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = СтрЗаменить(Отчет.СхемаКомпоновкиДанных.НаборыДанных[0].Запрос,"Справочник.общ_Подразделения","Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ИмяСправочникаПодразделений());
	КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Бюджет",Бюджет);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Версия",Версия);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подразделения",Подразделения);
	Отчет.СкомпоноватьРезультат(ТабличныйДокумент,ДанныеРасшифровкиКомпоновкиДанных);
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновкиДанных,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	РезультатОбработки = ОбработатьРасшифровку(Расшифровка);
	Если РезультатОбработки = Неопределено Тогда
		Возврат;
	ИначеЕсли РезультатОбработки.Действие = "ОткрытьЗначение" Тогда
		ПоказатьЗначение(,РезультатОбработки.Параметр);
	ИначеЕсли РезультатОбработки.Действие = "ВыбратьРежим" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораРежима",ЭтотОбъект);
		ПоказатьВыборИзСписка(ОписаниеОповещения,СписокРежимы,,СписокРежимы.НайтиПоЗначению(НЕ РезультатОбработки.Параметр));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРежима(Результат,ДополнительныеПараметры) Экспорт
	Если Результат<>Неопределено Тогда
		ОбработкаВыбораРежимаНаСервере(Результат.Значение);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРежимаНаСервере(Результат)
	НачатьТранзакцию();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_СтатьиБюджета.Ссылка КАК Статья
		|ПОМЕСТИТЬ ВТ_Статьи
		|ИЗ
		|	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|ГДЕ
		|	фин_СтатьиБюджета.Владелец = &Бюджет
		|	И фин_СтатьиБюджета.ЭтоГруппа = ЛОЖЬ
		|	И фин_СтатьиБюджета.ПометкаУдаления = ЛОЖЬ
		|	И (фин_СтатьиБюджета.Версия = &Версия
		|			ИЛИ фин_СтатьиБюджета.Версия = ЗНАЧЕНИЕ(Справочник.фин_ВерсииБюджетов.ПустаяСсылка))
		|	И ВЫБОР
		|			КОГДА &ИерархияСтатей
		|				ТОГДА фин_СтатьиБюджета.Ссылка В ИЕРАРХИИ (&Статьи)
		|			ИНАЧЕ фин_СтатьиБюджета.Ссылка В (&Статьи)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Подразделения.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ВТ_Подразделения
		|ИЗ
		|	Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ИмяСправочникаПодразделений()+" КАК Подразделения
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ИерархияПодразделений
		|				ТОГДА Подразделения.Ссылка В ИЕРАРХИИ (&Подразделения)
		|			ИНАЧЕ Подразделения.Ссылка В (&Подразделения)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Статьи.Статья,
		|	ВТ_Подразделения.Подразделение
		|ИЗ
		|	ВТ_Статьи КАК ВТ_Статьи
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Подразделения КАК ВТ_Подразделения
		|		ПО (ИСТИНА)";
	ИерархияПодразделений = Ложь;
	ИерархияСтатей = Ложь;
	ПодразделенияОтбора = Новый СписокЗначений;
	СтатьиОтбора = Новый СписокЗначений;
	
	СтрокиСтатья = ТаблицаОтбора.НайтиСтроки(Новый Структура("Поле","Статья"));
	Если СтрокиСтатья.Количество()>0 Тогда
		СтрокаТаблицы = СтрокиСтатья[0];
		ИерархияСтатей = СтрокаТаблицы.ВидСравнения = "ВИерархии";
		СтатьиОтбора.Добавить(СтрокаТаблицы.Значение);
	КонецЕсли;
	
	СтрокиПодразделение = ТаблицаОтбора.НайтиСтроки(Новый Структура("Поле","Подразделение"));
	Если СтрокиПодразделение.Количество()>0 Тогда
		СтрокаТаблицы = СтрокиПодразделение[0];
		ИерархияПодразделений = СтрокаТаблицы.ВидСравнения = "ВИерархии";
		ПодразделенияОтбора.Добавить(СтрокаТаблицы.Значение);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определено подразделение!");
			Возврат;
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определено подразделение!");
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Бюджет", Бюджет);
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ИерархияПодразделений", ИерархияПодразделений);
	Запрос.УстановитьПараметр("ИерархияСтатей", ИерархияСтатей);
	Запрос.УстановитьПараметр("Подразделения", ПодразделенияОтбора);
	Запрос.УстановитьПараметр("Статьи", СтатьиОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.фин_ПорядокФормированияЗаявокПоБюджетамПоПодразделениям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Бюджет.Установить(Бюджет);
		НаборЗаписей.Отбор.УправленческоеПодразделение.Установить(ВыборкаДетальныеЗаписи.Подразделение);
		НаборЗаписей.Отбор.СтатьяБюджета.Установить(ВыборкаДетальныеЗаписи.Статья);
		Если Результат = Истина Тогда
			НЗ = НаборЗаписей.Добавить();
			НЗ.Бюджет = Бюджет;
			НЗ.УправленческоеПодразделение = ВыборкаДетальныеЗаписи.Подразделение;
			НЗ.СтатьяБюджета = ВыборкаДетальныеЗаписи.Статья;
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;
	ЗаполнитьДанные();
	ЗафиксироватьТранзакцию();
КонецПроцедуры



&НаСервере
Функция ОбработатьРасшифровку(Расшифровка, ВариантРасшифровки = Неопределено)
	
	ДанныеДляОбработки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ИнформацияДляРасшифровки = ДанныеДляОбработки.Элементы.Получить(Расшифровка);
	Если ИнформацияДляРасшифровки <> Неопределено Тогда
		ДействиеРасшифровки = СокрЛП(Строка(ИнформацияДляРасшифровки.ОсновноеДействие));
		Данные = ИнформацияДляРасшифровки.ПолучитьПоля();
		Если ДействиеРасшифровки= "Нет" Тогда
			Возврат Неопределено;
		ИначеЕсли ДействиеРасшифровки = "Открыть значение" Тогда
			Возврат Новый Структура("Действие,Параметр","ОткрытьЗначение",Данные[0].Значение);
		ИначеЕсли ДействиеРасшифровки = "Расшифровать" Тогда
			ТаблицаОтбора.Очистить();
			//ТаблицаОтбора.Колонки.Добавить("Поле");
			//ТаблицаОтбора.Колонки.Добавить("ВидСравнения");
			//ТаблицаОтбора.Колонки.Добавить("Значение");
			ЗаполнитьОтборИзГруппировок(ТаблицаОтбора,ИнформацияДляРасшифровки,ДанныеДляОбработки);
			Возврат Новый Структура("Действие,Параметр","ВыбратьРежим",?(Данные[0].Значение=Null,Истина,Данные[0].Значение));
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьОтборИзГруппировок(ТаблицаОтбора,ИнформацияДляРасшифровки,ДанныеРасшифровки)
	РодительскиеПоля = ИнформацияДляРасшифровки.ПолучитьРодителей();
	Для Каждого ПолеРодитель Из РодительскиеПоля Цикл
		ДанныеРодителя = ДанныеРасшифровки.Элементы.Получить(ПолеРодитель.Идентификатор);
		Если НЕ ТипЗнч(ДанныеРодителя)=Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
			Для Каждого ПолеРодителя Из ДанныеРодителя.ПолучитьПоля() Цикл
				НС = ТаблицаОтбора.Добавить();
				НС.Поле = ПолеРодителя.Поле;
				НС.Значение = ПолеРодителя.Значение;
				НС.ВидСравнения = ?(ЗначениеЗаполнено(ПолеРодителя.Значение),?(ПолеРодителя.Иерархия,"ВИерархии","Равно"),"Незаполнено");
			КонецЦикла;
		КонецЕсли;
		ЗаполнитьОтборИзГруппировок(ТаблицаОтбора,ДанныеРодителя,ДанныеРасшифровки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ЗаполнитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПриИзменении(Элемент)
	ПодразделенияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделенияПриИзмененииНаСервере()
	ЗаполнитьДанные();
КонецПроцедуры
